//
// Created by ema on 26.10.26.
//
#include<iostream>
using namespace std;

int main() {
    // Да се напише програма за пресметување на сумата на сите парни двоцифрени броеви. Добиената сума се печати на екран.
    int sum = 0;
    // int i;
    for (int i = 10; i <= 98; i += 2) {
        sum += i;
    }
    cout << sum << endl;

    // Да се напише програма за пресметување на сумата на сите непарни двоцифрени броеви. Програмата ја печати сумата на екран во следниот формат:
    // 11 + 13 + 15 + 17 + … + 97 + 99 = 2475
    sum = 0;
    for (int i = 11; i <= 99; i += 2) {
        sum += i;
        if (i == 99) {
            cout << i;
        } else {
            cout << i << " + ";
        }
    }
    cout << " =" << sum;
    return 0;
}
